#!/usr/bin/env python
# coding: utf-8

# ___
# 
# <a href='https://mainacademy.ua/'> <img src='https://mainacademy.ua/wp-content/uploads/2019/03/logo-main.png' alt = 'Хмм, щось з інтернетом'/></a>
# ___
# 
# # Module 2: Basic Python

# ## Lab work 2.1
# 
# 

# #### Мета: 
# 
# * навчитися працювати із основними типами та структурами даних в Python;
# * ознайомитися із базовими алгоритмами;

# #### Завдання 1

# Обчислити площу трикутника, коли відома сторона та проведена висота до неї

# In[2]:


a = int(input())
h = int(input())

s = 1/2*a*h
print (s)


# #### Завдання 2

# Дано трицифрове число. Виведіть окремо кожну цифру числа та суми цифр число
# 
# Реалізуйте завдання двома способами (використовуючи стрічки та оператори `%`, `//`)

# In[10]:


n = input("Введіть трицифрове число - ")
n = int(n)
 
d1 = n % 10
d2 = n % 100 // 10
d3 = n // 100
 
print("Сума цифр числа:", d1 + d2 + d3)
print(d1, d2, d3)


# In[8]:


n = int(input())

n = int(n)
 
d1 = n % 10
n = n // 10
d2 = n % 10
n = n // 10
d3 = n % 10
 
print("Сума цифр числа:", d1 + d2 + d3)
print(d1, d2, d3)


# #### Завдання 3

# Дано речення (стрічка). 
# * Розбийте речення по словах і помістіть їх у список. 
# * Виведіть кількість слів у речені.
# * Утворіть нове речення, що складається з першого та останнього слова із початкового речення.

# In[ ]:


sentence = 'My favourite tutor in academy is Ihor'


# In[17]:


my_list = ["My", "favourite", "tutor", "in", "academy", "is", "Ihor"]


# In[18]:


len(my_list)


# In[26]:


print( my_list[0], my_list[6])


# #### Завдання 4

# Перевірте, чи справджується формула: $$ sin^2x + cos^2x = 1$$
# 
# Напишіть код, що реалізує цю формулу. Нагадую, що тригонометричні функції приймають аргументи в радіанній мірі

# In[ ]:


import math
x = int(input())
y = x*math.pi / 180
print(math.cos(y)**2+math.sin(y)**2)


# #### Завдання 5

# Напишіть програму для обчислення коренів квадратного рівняння.
# 
# Нагадую, що `n`-го степеня має `n` коренів. (Корені можуть бути комплексні)

# In[1]:


import cmath
print("Вкажіть коефіцієнти рівняння ")
print("ax^2 + bx + c = 0:")
a = int(input("a= "))
b = int(input("b= "))
c = int(input("c= "))

discr = b ** 2 - 4 * a * c
print("Дискриминант D = %.2f" % discr)
 
if discr > 0:
    x1 = (-b + cmath.sqrt(discr)) / (2 * a)
    x2 = (-b - cmath.sqrt(discr)) / (2 * a)
    print("x1 = %.2f \nx2 = %.2f" % (x1, x2))
elif discr == 0:
    x = -b / (2 * a)
    print("x = %.2f" % x)
else:
    print("Немає коренів")



# #### Завдання 6

# Напишіть програму, що виводить речення: <i>"Діаметр планети `Planet` дорівнює` Diament`"</i>, 
# 
# де `Planet` та `Diament` вводить користувач

# In[11]:


planet = input("Planet -")
diament = input("Diament -")
print('Діаметр планети ' + planet + ' дорвінює ' + diament + '')


# In[ ]:




